use bookshop;

SET NAMES utf8;

insert into book (name, date_publication, date_issue, description, price, in_stock) 
	values('Машина времени', '1888.1.1', '2017.04.01', 
		'Роман Герберта Уэллса, его первое крупное научно-фантастическое произведение. Переработана из рассказа 1888 года «Аргонавты времени» и издана в 1895 году. «Машина времени» ввела в фантастику идею путешествия во времени и используемой для этого машины времени, которые 		использовались позднее множеством писателей и создали направление хронофантастики. Более того, как отмечал Ю. И. Кагарлицкий, как в научном, так и в общемировоззренческом отношении Уэллс «…в известном смысле предвосхитил Эйнштейна», сформулировавшего специальную теорию относительности спустя десять лет после выхода романа',
		32.5, 4);

insert into book (name, date_publication, date_issue, description, price, in_stock) 
	values('Чужак в чужой стране', '1962.1.1', '2017.08.01', 
		'Фантастический философский роман Роберта Хайнлайна, в 1962 году удостоенный премии «Хьюго». На Западе имеет «культовый» статус, считаясь самым известным из фантастических романов, когда-либо написанных. Одно из немногих фантастических произведений, включённых Библиотекой Конгресса в список книг, сформировавших Америку.',
		40.5, 7);

insert into book (name, date_publication, date_issue, description, price, in_stock) 
	values('Дюна ', '1965.1.1', '2017.07.01', 
		'Первый роман Фрэнка Герберта из саги «Хроники Дюны» о песчаной планете Арракис. Именно эта книга сделала его известным. «Дюна» была удостоена премий Хьюго и Небьюла. «Дюна» — один из самых известных научно-фантастических романов XX века.',
		50.5, 7);  

insert into book (name, date_publication, date_issue, description, price, in_stock) 
	values('Нейромант', '1984.1.1', '2017.08.31', 
		'Роман Уильяма Гибсона, каноническое произведение в жанре «киберпанк», удостоенное премий «Небьюла» (1984), «Хьюго» (1985) и Приза Филипа Дика. Это первый роман Гибсона, открывающий трилогию «Киберпространство». Опубликован в 1984 году.',
		39.15, 2);  


insert into book (name, date_publication, date_issue, description, price, in_stock) 
	values('Мечтают ли андроиды об электроовцах?', '1968.1.1', '2017.08.21', 
		'Научно-фантастический роман Филипа Дика, написанный в 1968 году. Рассказывает историю «охотника за головами» Рика Декарда, который преследует андроидов — существ, почти неотличимых от человека, объявленных вне закона на Земле. Действие происходит в отравленном радиацией и частично заброшенном Сан-Франциско будущего.',
		40.5, 7);  

insert into book (name, date_publication, date_issue, description, price, in_stock) 
	values('Врата', '1977.1.1', '2017.12.21', 
		'Научно-фантастический роман американского писателя Фредерика Пола, изданный в 1977 году и получивший все три главные американские премии жанра — «Небьюлу» (1977), «Хьюго» (1978) и Локус (1978). Роман открывает цикл «Хичи».',
		41.51, 14);    